re-former/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "pugs"], ["email", "1234@gmail.vom"], ["password", "123456789"], ["created_at", "2015-11-26 14:48:18.915351"], ["updated_at", "2015-11-26 14:48:18.915351"]]
---
  def create
    # @user = User.new(username: params[:username], email: params[:email], password: params[:password])
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "username" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "pugo"], ["password", "123123123123"], ["updated_at", "2015-11-26 16:16:09.011597"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)